reports/08-run-laptop/ab_rust.log
$ ab -n 1000000 -c 8 192.168.1.211:8000/contacts/1
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.1.211 (be patient)
Completed 100000 requests
Completed 200000 requests
Completed 300000 requests
Completed 400000 requests
Completed 500000 requests
Completed 600000 requests
Completed 700000 requests
Completed 800000 requests
Completed 900000 requests
Completed 1000000 requests
Finished 1000000 requests


Server Software:        
Server Hostname:        192.168.1.211
Server Port:            8000

Document Path:          /contacts/1
Document Length:        87 bytes

Concurrency Level:      8
Time taken for tests:   240.108 seconds
Complete requests:      1000000
Failed requests:        0
Total transferred:      163000000 bytes
HTML transferred:       87000000 bytes
Requests per second:    4164.79 [#/sec] (mean)
Time per request:       1.921 [ms] (mean)
Time per request:       0.240 [ms] (mean, across all concurrent requests)
Transfer rate:          662.95 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.2      1      12
Processing:     0    1   0.3      1      10
Waiting:        0    1   0.3      1      10
Total:          1    2   0.3      2      15

Percentage of the requests served within a certain time (ms)
  50%      2
  66%      2
  75%      2
  80%      2
  90%      2
  95%      2
  98%      2
  99%      3
 100%     15 (longest request)